SiliconLabs/wfx-fullMAC-tools/Examples/STM32/Drivers/wfx_fmac_driver/sl_wfx.h
/**************************************************************************//**
 * Copyright 2018, Silicon Laboratories Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************/

#ifndef SL_WFX_H
#define SL_WFX_H

#include "sl_wfx_constants.h"
#include "sl_wfx_configuration.h"
#include "sl_wfx_host_api.h"
#include "sl/sl_status.h"
#include "bus/sl_wfx_bus.h"
#include "firmware/sl_wfx_registers.h"
#include "sl/sl_status.h"
#include "wfm_api.h"
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>

#ifdef __cplusplus
extern "C"
{
#endif

sl_status_t sl_wfx_init(sl_wfx_context_t *context);

sl_status_t sl_wfx_deinit(void);

sl_status_t sl_wfx_enable_irq(void);

sl_status_t sl_wfx_disable_irq(void);

sl_status_t sl_wfx_shutdown(void);

sl_status_t sl_wfx_receive_frame(uint16_t *ctrl_reg);

sl_status_t sl_wfx_send_configuration(const char *pds_data, uint32_t pds_data_length);

sl_status_t sl_wfx_control_gpio(uint8_t gpio_label, uint8_t gpio_mode, uint32_t *value);

sl_status_t sl_wfx_prevent_rollback(uint32_t magic_word);

sl_status_t sl_wfx_get_opn(uint8_t **opn);

/*
 * Send Ethernet frame
 */
sl_status_t sl_wfx_send_ethernet_frame(sl_wfx_send_frame_req_t *frame,
                                       uint32_t data_length,
                                       sl_wfx_interface_t interface,
                                       uint8_t priority);

/*
 * Send generic WF200 command
 */
sl_status_t sl_wfx_send_command(uint8_t command_id,
                                void *data,
                                uint32_t data_size,
                                sl_wfx_interface_t interface,
                                sl_wfx_generic_confirmation_t **response);

sl_status_t sl_wfx_send_request(uint8_t id, sl_wfx_generic_message_t *request, uint16_t request_length);

/*
 * Synchronous WF200 commands
 */
sl_status_t sl_wfx_set_access_mode_message(void);

sl_status_t sl_wfx_set_mac_address(const sl_wfx_mac_address_t *mac, sl_wfx_interface_t interface);

sl_status_t sl_wfx_set_power_mode(sl_wfx_pm_mode_t mode, uint16_t interval);

sl_status_t sl_wfx_set_wake_up_bit(uint8_t state);

sl_status_t sl_wfx_join_ibss_command(const uint8_t *ssid,
                                     uint32_t ssid_length,
                                     uint32_t channel,
                                     uint16_t security_mode,
                                     const uint8_t *passkey,
                                     uint16_t passkey_length);

sl_status_t sl_wfx_leave_ibss_command(void);

sl_status_t sl_wfx_get_signal_strength(uint32_t *rcpi);

sl_status_t sl_wfx_add_multicast_address(const sl_wfx_mac_address_t *mac_address, sl_wfx_interface_t interface);

sl_status_t sl_wfx_remove_multicast_address(const sl_wfx_mac_address_t *mac_address, sl_wfx_interface_t interface);

sl_status_t sl_wfx_set_arp_ip_address(uint32_t *arp_ip_addr, uint8_t num_arp_ip_addr);

sl_status_t sl_wfx_set_ns_ip_address(uint8_t *ns_ip_addr, uint8_t num_ns_ip_addr);

sl_status_t sl_wfx_set_broadcast_filter(uint32_t filter);

sl_status_t sl_wfx_set_unicast_filter(uint32_t filter);

sl_status_t sl_wfx_add_whitelist_address(const sl_wfx_mac_address_t *mac_address);

sl_status_t sl_wfx_add_blacklist_address(const sl_wfx_mac_address_t *mac_address);

sl_status_t sl_wfx_set_max_ap_client(uint32_t max_clients);

sl_status_t sl_wfx_set_max_ap_client_inactivity(uint32_t inactivity_timeout);

sl_status_t sl_wfx_set_scan_parameters(uint16_t active_channel_time,
                                       uint16_t passive_channel_time,
                                       uint16_t num_probe_requestuests);

sl_status_t sl_wfx_set_roam_parameters(uint8_t rcpi_threshold,
                                       uint8_t rcpi_hysteresis,
                                       uint8_t beacon_lost_count,
                                       const uint8_t *channel_list,
                                       uint8_t channel_list_count);

sl_status_t sl_wfx_set_tx_rate_parameters(sl_wfx_rate_set_bitmask_t rate_set_bitmask);

sl_status_t sl_wfx_set_max_tx_power(int32_t max_tx_power, sl_wfx_interface_t interface);

sl_status_t sl_wfx_get_max_tx_power(int32_t *max_tx_power_rf_port_1,
                                    int32_t *max_tx_power_rf_port_2,
                                    sl_wfx_interface_t interface);

/*
 * Asynchronous WF200 commands
 */
sl_status_t sl_wfx_send_join_command(const uint8_t *ssid,
                                     uint32_t ssid_length,
                                     const sl_wfx_mac_address_t *bssid,
                                     uint16_t channel,
                                     sl_wfx_security_mode_t security_mode,
                                     uint8_t prevent_roaming,
                                     uint16_t management_frame_protection,
                                     const uint8_t *passkey,
                                     uint16_t passkey_length,
                                     const uint8_t *ie_data,
                                     uint16_t ie_data_length);

sl_status_t sl_wfx_send_disconnect_command(void);

sl_status_t sl_wfx_send_scan_command(uint16_t scan_mode,
                                     const uint8_t *channel_list,
                                     uint16_t channel_list_count,
                                     const sl_wfx_ssid_def_t *ssid_list,
                                     uint16_t ssid_list_count,
                                     const uint8_t *ie_data,
                                     uint16_t ie_data_length);

sl_status_t sl_wfx_send_stop_scan_command(void);

sl_status_t sl_wfx_start_ap_command(uint16_t channel,
                                    uint8_t *ssid,
                                    uint32_t ssid_length,
                                    uint8_t hidden_ssid,
                                    uint8_t client_isolation,
                                    sl_wfx_security_mode_t security_mode,
                                    uint8_t management_frame_protection,
                                    const uint8_t *passkey,
                                    uint16_t passkey_length,
                                    const uint8_t *beacon_ie_data,
                                    uint16_t beacon_ie_data_length,
                                    const uint8_t *probe_response_ie_data,
                                    uint16_t probe_response_ie_data_length);

sl_status_t sl_wfx_update_ap_command(uint16_t beacon_ie_data_length,
                                     uint16_t probe_response_ie_data_length,
                                     uint32_t *beacon_ie_data,
                                     uint32_t *probe_response_ie_data);

sl_status_t sl_wfx_stop_ap_command(void);

sl_status_t sl_wfx_disconnect_ap_client_command(const sl_wfx_mac_address_t *client);

/*
 * WF200 test mode
 */

sl_status_t sl_wfx_set_antenna_config(sl_wfx_antenna_config_t config);

sl_status_t sl_wfx_allocate_command_buffer(sl_wfx_generic_message_t **buffer,
                                           uint32_t command_id,
                                           uint32_t buffer_size,
                                           uint32_t wait_duration_ms);

#ifdef __cplusplus
} /*extern "C" */
#endif

#endif // SL_WFX_H
